Repository: Taiteilija/op-kassa-for-woocommerce
Catalog: languages/woocommerce-kis-*.po
Languages: fi

source: WooCommerce OP Kassa: The %1$sWordPress REST API – OAuth 1.0a Server%2$s plugin must be installed and activated!
fi: WooCommerce OP Kassa: %1$sWordPress REST API – OAuth 1.0a Server%2$s -lisäosan tulee olla asennettu ja aktivoitu!

source: WooCommerce OP Kassa: An error occurred while authenticating the integration to WooCommerce. Please try again later!
fi: WooCommerce OP Kassa: WooCommercen integraation autentikaatiossa tapahtui virhe. Yritä myöhemmin uudelleen!

source: WooCommerce OP Kassa: An error occurred while authenticating the integration to OP Kassa. Please try again later!
fi: WooCommerce OP Kassa: OP Kassa -integraation autentikaatiossa tapahtui virhe. Yritä myöhemmin uudelleen!

source: WooCommerce OP Kassa: You are not authorized to disconnect the integration!
fi: WooCommerce OP Kassa: sinulla ei ole oikeutta katkaista integraatiota!

source: Integration options
fi: Integraatio-asetukset

source: On this page you can manage Kassa integration settings. Plugin version: (%s)
fi: Tällä sivulla voit hallita Kassa-integraation asetuksia. Lisäosan versio: (%s)

source: OP Kassa Integration
fi: OP Kassa Integraatio

source: Sync settings
fi: Synkronointiasetukset

source: Product export
fi: Tuotteiden vienti

source: Woo to Kassa
fi: WooCommercesta Kassaan

source: Kassa to Woo
fi: Kassasta WooCommerceen

source: Off
fi: Pois päältä

source: Order export
fi: Tilausten vienti

source: Both
fi: Vie molempiin suuntiin

source: Stock export
fi: Varaston vienti

source: Integration status
fi: Integraation tila

source: Connected
fi: Yhdistetty

source: Disconnect
fi: Katkaise yhteys

source: Not connected
fi: Ei yhteyttä

source: Connect
fi: Yhdistä

source: Merchant details
fi: Kauppiaan tiedot

source: OP Kassa account
fi: OP Kassa -tili

source: OP Kassa mode
fi: OP Kassan tila

source: Phone number
fi: Puhelinnumero

source: Company name
fi: Yrityksen nimi

source: Company address
fi: Yrityksen osoite

source: The KIS connection was successfully cancelled!
fi: KIS-yhteys katkaistu onnistuneesti!

source: Connected successfully!
fi: Yhteys muodostettu onnistuneesti!

source: You are not allowed to create the connection!
fi: Sinulla ei ole oikeutta muodostaa yhteyttä!

source: Connecting to Kassa failed!
fi: Yhdistäminen Kassaan epäonnistui!

# "%s" is a placeholder for the error message.
source: Connecting to WooCommerce failed! Error: %s
fi: Yhdistäminen WooCommerceen epäonnistui! Virhe: %s

source: Connecting to WooCommerce failed! An error occurred when creating the WordPress OAuth application.
fi: Yhdistäminen WooCommerceen epäonnistui! WordPress OAuth -sovelluksen luomisessa tapahtui virhe.

source: WooCommerce OP Kassa Integration
fi: WooCommerce OP Kassa -integraatio

source: This plugin integrates WooCommerce with OP Kassa.
fi: Tämä lisäosa integroi WooCommercen OP Kassaan.

source: Plugin system audit
fi: Kassa-integraatio-lisäosan eheys

source: Run system audit
fi: Aja järjestelmätesti

source: System audit report:
fi: Järjestelmätestiraportti:

source: System audit configuration file not found!
fi: Järjestelmätestin asetukset-tiedostoa ei löydy. Järjestelmätestiä ei voida suorittaa!

source: System audit passed!
fi: Järjestelmätesti suoritettu onnistuneesti!

source: System variable not set:
fi: Järjestelmämuuttujaa ei ole asetettu:

source: System memory limit insufficient
fi: Järjestelmämuuttujan memory_limit arvo ei vastaa minimivaatimuksia

source: Max execution time limit insufficient
fi: Järjestelmämuuttujan max_execution_time arvo ei vastaa minimivaatimuksia

source: The following active plugin may be incompatible:
fi: Mahdollisesti yhteensopimaton lisäosa löydetty:

source: The following plugin needs to be installed and activated:
fi: Pakollinen lisäosa puuttuu:

source: The target system URL did respond with an error code:
fi: Integraation kohdejärjestelmä vastasi virhekoodilla:

source: The Wordpress setting
fi: Wordpress asetus

source: needs to be set to:
fi: pitää olla asetettu seuraavasti:

source: Permalink Settings -> Common Settings = Post name
fi: Osoiterakenteen asetukset -> Yleiset asetukset = Artikkelin nimi

source: Audit Warning:
fi: Järjestelmätestissä löytyi mahdollisia ongelmia:

source: Audit Failed:
fi: Järjestelmätestissä löytyi virheitä:

source: Audit Success!
fi: Järjestelmätestissä ei löytynyt virheitä!

source: OP Kassa Environment
fi: OP Kassan toimintaympäristö

source: Connect to OP Kassa Test Environment
fi: Yhdistä OP Kassan testiympäristöön

source: Check the "Connect to OP Kassa Test Environment"-option below to use Kassa Test Environment and save the settings. <div class="setting-warning">WARNING: Changing the environment disconnects Your WooCommerce instance from Kassa, if connected.</div>
fi: Valitse "Yhdistä OP Kassan testiympäristöön" halutessasi yhdistää OP Kassan testiympäristöön ja tallenna asetukset. <div class="setting-warning">VAROITUS: Toimintaympäristön vaihtaminen aiheuttaa mahdollisen nykyisen Kassa-yhteyden katkaisemisen.</div>

source: Authentication settings
fi: Autentikointiasetukset

source: Receive OP Kassa integration authentication data in URL params instead of request header. Save the new settings before connecting to OP Kassa.<div class="setting-warning">NOTE: Enabling this authentication method potentially weakens the security of the site. Enable this setting only if You know what You are doing!<div>Changing the auth method disconnects Your WooCommerce instance from Kassa, if connected.</div></div>
fi: OP Kassa-integraation autentikointitiedot vastaanotetaan URL-parametreinä HTTP-pyynnön header-tietojen sijaan. Tehtyäsi tämän muutoksen, tallenna tämä sivu ennen kuin yhdistät OP Kassaan.<div class="setting-warning">VAROITUS: Tämän asetuksen muuttaminen saattaa heikentää tietoturvaa, joten älä muuta sitä ellet tiedä mitä olet tekemässä!<div>Autentikaatiotietojen vastaanottometodin vaihtaminen aiheuttaa mahdollisen nykyisen Kassa-yhteyden katkaisemisen!</div></div>

source: OP Kassa Auth data in URL params
fi: OP Kassa autentikaatiotiedot URL-parametreinä

source: Test Environment
fi: Testiympäristö

source: Production Environment
fi: Tuotantoympäristö

source: test
fi: Testiympäristö

source: production
fi: Tuotantoympäristö

source: CUSTOM (environmental urls probably set up in wp-config.php. These settings override the environment selection.)
fi: RÄÄTÄLÖITY (Toimintaympäristön osoitteet ovat todennäköisesti määritelty wp-config.php-tiedostossa. Nämä määrittelyt ajavat tämän sivun toimintaympäristövalinnan yli.)

source: Before You can connect to Kassa, please select the target environment above and save the settings page.
fi: Ennen kuin voit yhdistää OP Kassaan, sinun tulee valita yllä OP Kassan toimintaympäristö ja tallentaa sivu.

source: Not selected
fi: Ei valittu

source: The OP Kassa environment (test/production) has not been selected. Select the environment in the plugin <a href="/wp-admin/admin.php?page=wc-settings&tab=kis"><b>settings</b></a>.
fi: OP Kassan toimintaympäristöä ( testi / tuotanto ) ei ole vielä valittu. Valitse toimintaympäristö lisäosan <a href="/wp-admin/admin.php?page=wc-settings&tab=kis"><b>Asetukset-sivulta</b></a>.

source: The OP Kassa-plugin has not yet been connected to Kassa. Connect to Kassa in the plugin <a href="/wp-admin/admin.php?page=wc-settings&tab=kis"><b>settings</b></a>.
fi: OP Kassa fo WooCommerce-lisäosaa ei ole vielä yhdistetty OP Kassaan. Yhdistä OP Kassaan lisäosan <a href="/wp-admin/admin.php?page=wc-settings&tab=kis"><b>Asetukset-sivulta</b></a>.

source: qTranslate-plugin seems to be activated! To prevent issues with the OP Kassa-plugin, please select the <i>"Hide URL language information for default language."</i>-setting (if it is available) in the <i>"Settings"</i> -> <i>"Languages"</i> -> <i>"General"</i>.
fi: qTranslate-lisäosa näyttää olevan aktivoituna. Jotta kyseinen lisäosa toimisi oikein OP Kassa-lisäosan kanssa, tulee <i>"Hide URL language information for default language."</i>-asetuksen olla valittuna yleisasetuksissa: <i>"Asetukset"</i> -> <i>"Languages"</i> -> <i>"General"</i>.

source: The free Polylang-plugin is recommended to be upgraded to <a href="https://polylang.pro/downloads/polylang-pro/">'Polylang Pro'</a> and <a href="https://polylang.pro/downloads/polylang-for-woocommerce/">'Polylang for Woocommerce'</a>-plugins. <a href="https://polylang.pro/downloads/polylang-pro-for-woocommerce/">'Polylang Pro for Woocommerce'</a>-bundle includes both mandatory plugins.
fi: Ilmainen Polylang-lisäosa on suositeltavaa päivittää <a href="https://polylang.pro/downloads/polylang-pro/">'Polylang Pro'</a> sekä <a href="https://polylang.pro/downloads/polylang-for-woocommerce/">'Polylang for Woocommerce'</a>-lisäosiin. <a href="https://polylang.pro/downloads/polylang-pro-for-woocommerce/">'Polylang Pro for Woocommerce'</a>-paketti sisältää molemmat lisäosat.

source: WooCommerce OP Kassa: An error occurred while authenticating the integration to OP Kassa: Woocommerce addon has not been activated. Activate the addon in the OP Kassa management panel and try again.
fi: WooCommerce OP Kassa: WooCommercen integraation autentikaatiossa tapahtui virhe: OP Kassan WooCommerce-laajennosta ei ole aktivoitu. Tilaa laajennos OP Kassan hallintapaneelista ja yritä uudelleen.

source: WooCommerce OP Kassa: An error occurred while authenticating the integration to OP Kassa (error code:
fi: WooCommerce OP Kassa: WooCommercen integraation autentikaatiossa tapahtui virhe (virhekoodi:

source: The site domain has changed: OP Kassa has been disconnected.
fi: WooCommercen verkkotunnus on vaihtunut: OP Kassa yhteys on katkaistu.

source: Old domain:
fi: Vanha verkkotunnus:

source: New domain:
fi: Uusi verkkotunnus:

source: Please make sure the new domain is correct before re-connecting to OP Kassa.
fi: Varmista, että uusi verkkotunnus on oikein ennen kuin yhdistät WooCommercen uudelleen OP Kassaan.

source: NOTE! If You connect to OP Kassa with same credentials than earlier, the products may be duplicated during the product synchronization. You may want to delete the products from OP Kassa prior new connection.
fi: HUOMAA! Mikäli OP Kassaan yhdistetään samoilla tunnuksilla kuin ennen verkkotunnuksen muuttamista, aiemmalla verkkotunnuksella synkronoidut tuotteet saattavat monistua. Synkronoidut tuotteet kannattaa poistaa ennen yhteyden uudelleen muodostamista, jolloin ne synkroinoidaan uudelleen.

source: Tax settings
fi: Veroasetukset

source: Enable WooCommerce tax calculation
fi: Laske verot WooCommercessa

source: Use WooCommerce tax calculation on synchronized order prices.<div class="setting-warning">NOTE:<div>There may be rounding differences between OP Kassa and WooCommerce orders if this option is enabled.</div><div>Products and Fees on OP Kassa purchases which are not found in WooCommerce, use the default tax class VAT percentage. This may differ from OP Kassa.</div></div>
fi: Ota käyttöön WooCommercen verolaskenta siirretyistä OP Kassan myynneissä.<div class="setting-warning">HUOMAA!<div>Verolaskenta WooCommercessa saattaa aiheuttaa pyöristyseroja OP Kassan tilauksiin nähden.</div><div>OP Kassan myynneissä olevien tuotteiden ja lisämaksujen osalta verolaskennassa käytetään perusveroprosenttia, mikäli ko. tuotteita ei ole määritelty WooCommercessa. Tämä saattaa erota OP Kassassa määritellystä veroprosentista.</div></div>
